tutorials/cavitatingFoam/nozzle2D/constant/thermodynamicProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          thermodynamicProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

compressibilityModel          linear; //Chung;

psiv                          psiv       [0 -2 2 0 0]     4.662e-5;

rholSat                       rholSat    [1 -3 0 0 0]     828;
psil                          psil       [0 -2 2 0 0]     4.756e-7;

pSat                          pSat       [1 -1 -2 0 0]    3325;

rhoMin                        rhoMin     [1 -3 0 0 0]     0.001;

// ************************************************************************* //
