tutorials/cavitatingFoam/nozzle2D/system/fvSolution
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho smoothSolver
    {
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0;
        nSweeps          1;
    };

    U smoothSolver
    {
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0;
        nSweeps          1;
    };

    p PCG
    {
        preconditioner
        {
            type        DIC;
        }

        minIter          0;
        maxIter          2000;
        tolerance        1e-10;
        relTol           0;
    };
}

PISO
{
    nCorrectors                2;
    nNonOrthogonalCorrectors   0;

    removeSwirl                2;
}

// ************************************************************************* //
